#### Terraform Format and Style 🖌`success`
#### shared-services Terraform Initialization ⚙️`success`
#### shared-services Terraform Validation 🤖[32m[1mSuccess![0m The configuration is valid.
[0m

#### shared-services Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
[0m[1mRefreshing Terraform state in-memory prior to plan...[0m
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.
[0m
[0m[1mmodule.container_registry.module.container_registry.random_string.base: Refreshing state... [id=o5lu][0m
[0m[1mmodule.boot_diag_storage.module.diagnostic_storage_account.random_string.base: Refreshing state... [id=Rvwc][0m
[0m[1mmodule.key_vault.module.key_vault.random_string.base: Refreshing state... [id=tPY6][0m
[0m[1mmodule.network_transit_hub.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus][0m
[0m[1mmodule.container_registry.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-container-registry-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus][0m
[0m[1mmodule.key_vault.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-key-vault-shared-services-eastus][0m
[0m[1mmodule.key_vault.module.key_vault_access_policy.data.azurerm_client_config.current: Refreshing state...[0m
[0m[1mmodule.boot_diag_storage.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-diagnostic-storage-shared-services-eastus][0m
[0m[1mmodule.windows_jumpbox.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-jumpbox-shared-services-eastus][0m
[0m[1mmodule.key_vault.module.key_vault.data.azurerm_client_config.current: Refreshing state...[0m
[0m[1mmodule.bastion.module.resource_group.azurerm_resource_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-bastion-shared-services-eastus][0m
[0m[1mmodule.network_transit_hub.module.virtual_network.azurerm_virtual_network.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus][0m
[0m[1mmodule.network_transit_hub.module.public_ip_fw.azurerm_public_ip.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/publicIPAddresses/pip-fw-shared-services-eastus][0m
[0m[1mmodule.network_transit_hub.module.public_ip_vgw.azurerm_public_ip.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/publicIPAddresses/pip-vgw-shared-services-eastus][0m
[0m[1mmodule.container_registry.module.container_registry.azurerm_container_registry.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-container-registry-shared-services-eastus/providers/Microsoft.ContainerRegistry/registries/acrsho5lueastus][0m
[0m[1mmodule.boot_diag_storage.module.diagnostic_storage_account.azurerm_storage_account.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-diagnostic-storage-shared-services-eastus/providers/Microsoft.Storage/storageAccounts/stdiagshrvwceastus][0m
[0m[1mmodule.windows_jumpbox.module.network_security_group.azurerm_network_security_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-jumpbox-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-rdpallow-shared-services][0m
[0m[1mmodule.bastion.module.public_ip.azurerm_public_ip.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-bastion-shared-services-eastus/providers/Microsoft.Network/publicIPAddresses/pip-bastion-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.network_security_group.azurerm_network_security_group.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services][0m
[0m[1mmodule.domain_controllers.module.managed_disk.azurerm_managed_disk.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/disks/datadisk-wvm-dc-00-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.managed_disk.azurerm_managed_disk.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/disks/datadisk-wvm-dc-01-shared-services-eastus][0m
[0m[1mmodule.network_transit_hub.module.virtual_network_gateway.azurerm_subnet.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/subnets/GatewaySubnet][0m
[0m[1mmodule.network_transit_hub.module.firewall.azurerm_subnet.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/subnets/AzureFirewallSubnet][0m
[0m[1mmodule.domain_controllers.module.subnet.azurerm_subnet.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/subnets/snet-adds-shared-services-eastus][0m
[0m[1mmodule.windows_jumpbox.module.subnet.azurerm_subnet.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/subnets/snet-jumpbox-shared-services-eastus][0m
[0m[1mmodule.bastion.module.bastion.azurerm_subnet.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/subnets/AzureBastionSubnet][0m
[0m[1mmodule.windows_jumpbox.module.network_security_rule.azurerm_network_security_rule.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-jumpbox-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-rdpallow-shared-services/securityRules/Allow RDP][0m
[0m[1mmodule.windows_jumpbox.module.network_security_rule.azurerm_network_security_rule.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-jumpbox-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-rdpallow-shared-services/securityRules/Deny RDP][0m
[0m[1mmodule.network_transit_hub.module.virtual_network_gateway.azurerm_virtual_network_gateway.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworkGateways/vgw-shared-services-eastus][0m
[0m[1mmodule.network_transit_hub.module.firewall.azurerm_firewall.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/azureFirewalls/azfw-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.subnet_network_security_group_association.azurerm_subnet_network_security_group_association.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/subnets/snet-adds-shared-services-eastus][0m
[0m[1mmodule.windows_jumpbox.module.subnet_network_security_group_association.azurerm_subnet_network_security_group_association.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/subnets/snet-jumpbox-shared-services-eastus][0m
[0m[1mmodule.windows_jumpbox.module.network_interface.azurerm_network_interface.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-jumpbox-shared-services-eastus/providers/Microsoft.Network/networkInterfaces/nic-wvm-jumpbox-00-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.network_interface.azurerm_network_interface.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkInterfaces/nic-wvm-dc-00-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.network_interface.azurerm_network_interface.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkInterfaces/nic-wvm-dc-01-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[12]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/Kerberos change and set password][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[11]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/Windows Time][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[9]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/RPC, DCOM, EPM, DRSUAPI, NetLogonR, SamR, FRS][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[7]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/SMTP][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[3]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/LDAP GC SSL][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[4]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/Kerberos][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[17]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/DFSN, NetBIOS Session Service, NetLogon][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[5]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/DNS][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[14]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/DFSN, NetLogon, NetBIOS Datagram Service][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[15]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/SOAP][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[8]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/RPC, EPM][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/LDAP SSL][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[13]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/DCOM, RPC, EPM][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/LDAP][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[6]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/SMB,CIFS,SMB2, DFSN, LSARPC, NbtSS, NetLogonR, SamR, SrvSvc][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[2]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/LDAP GC][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[16]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/NetLogon, NetBIOS Name Resolution][0m
[0m[1mmodule.bastion.module.bastion.azurerm_bastion_host.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-bastion-shared-services-eastus/providers/Microsoft.Network/bastionHosts/bastion-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.network_security_rule.azurerm_network_security_rule.base[10]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services/securityRules/RPC, DFSR (SYSVOL)][0m
[0m[1mmodule.key_vault.module.key_vault.azurerm_key_vault.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-key-vault-shared-services-eastus/providers/Microsoft.KeyVault/vaults/kvshtpy6eastus][0m
[0m[1mmodule.windows_jumpbox.module.virtual_machine.azurerm_windows_virtual_machine.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-jumpbox-shared-services-eastus/providers/Microsoft.Compute/virtualMachines/wvm-jumpbox-00-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.virtual_machine.azurerm_windows_virtual_machine.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/virtualMachines/wvm-dc-00-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.virtual_machine.azurerm_windows_virtual_machine.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/virtualMachines/wvm-dc-01-shared-services-eastus][0m
[0m[1mmodule.key_vault.module.key_vault_access_policy.azurerm_key_vault_access_policy.base: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-key-vault-shared-services-eastus/providers/Microsoft.KeyVault/vaults/kvshtpy6eastus/objectId/e7e9c92f-4927-48e5-9042-263c2e65ba36][0m
[0m[1mmodule.domain_controllers.module.virtual_machine_data_disk_attachment.azurerm_virtual_machine_data_disk_attachment.base[1]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/virtualMachines/wvm-dc-01-shared-services-eastus/dataDisks/datadisk-wvm-dc-01-shared-services-eastus][0m
[0m[1mmodule.domain_controllers.module.virtual_machine_data_disk_attachment.azurerm_virtual_machine_data_disk_attachment.base[0]: Refreshing state... [id=/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Compute/virtualMachines/wvm-dc-00-shared-services-eastus/dataDisks/datadisk-wvm-dc-00-shared-services-eastus][0m

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  [32m+[0m create
  [33m~[0m update in-place
[0m
Terraform will perform the following actions:

[1m  # module.audit_logs.module.archive_storage_account.azurerm_storage_account.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_storage_account" "base" {
      [32m+[0m [0m[1m[0maccess_tier[0m[0m                      = "Hot"
      [32m+[0m [0m[1m[0maccount_kind[0m[0m                     = "StorageV2"
      [32m+[0m [0m[1m[0maccount_replication_type[0m[0m         = "LRS"
      [32m+[0m [0m[1m[0maccount_tier[0m[0m                     = "Standard"
      [32m+[0m [0m[1m[0menable_https_traffic_only[0m[0m        = true
      [32m+[0m [0m[1m[0mid[0m[0m                               = (known after apply)
      [32m+[0m [0m[1m[0mis_hns_enabled[0m[0m                   = false
      [32m+[0m [0m[1m[0mlocation[0m[0m                         = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                             = (known after apply)
      [32m+[0m [0m[1m[0mprimary_access_key[0m[0m               = (sensitive value)
      [32m+[0m [0m[1m[0mprimary_blob_connection_string[0m[0m   = (sensitive value)
      [32m+[0m [0m[1m[0mprimary_blob_endpoint[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprimary_blob_host[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mprimary_connection_string[0m[0m        = (sensitive value)
      [32m+[0m [0m[1m[0mprimary_dfs_endpoint[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mprimary_dfs_host[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mprimary_file_endpoint[0m[0m            = (known after apply)
      [32m+[0m [0m[1m[0mprimary_file_host[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mprimary_location[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mprimary_queue_endpoint[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mprimary_queue_host[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mprimary_table_endpoint[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mprimary_table_host[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0mprimary_web_endpoint[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mprimary_web_host[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m              = "rg-logs-shared-services-eastus"
      [32m+[0m [0m[1m[0msecondary_access_key[0m[0m             = (sensitive value)
      [32m+[0m [0m[1m[0msecondary_blob_connection_string[0m[0m = (sensitive value)
      [32m+[0m [0m[1m[0msecondary_blob_endpoint[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msecondary_blob_host[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0msecondary_connection_string[0m[0m      = (sensitive value)
      [32m+[0m [0m[1m[0msecondary_dfs_endpoint[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0msecondary_dfs_host[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0msecondary_file_endpoint[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0msecondary_file_host[0m[0m              = (known after apply)
      [32m+[0m [0m[1m[0msecondary_location[0m[0m               = (known after apply)
      [32m+[0m [0m[1m[0msecondary_queue_endpoint[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0msecondary_queue_host[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0msecondary_table_endpoint[0m[0m         = (known after apply)
      [32m+[0m [0m[1m[0msecondary_table_host[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0msecondary_web_endpoint[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0msecondary_web_host[0m[0m               = (known after apply)

      [32m+[0m [0mblob_properties {
          [32m+[0m [0mcors_rule {
              [32m+[0m [0m[1m[0mallowed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_methods[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_origins[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mexposed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mmax_age_in_seconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mdelete_retention_policy {
              [32m+[0m [0m[1m[0mdays[0m[0m = (known after apply)
            }
        }

      [32m+[0m [0midentity {
          [32m+[0m [0m[1m[0mprincipal_id[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mtenant_id[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mtype[0m[0m         = (known after apply)
        }

      [32m+[0m [0mnetwork_rules {
          [32m+[0m [0m[1m[0mbypass[0m[0m                     = (known after apply)
          [32m+[0m [0m[1m[0mdefault_action[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mip_rules[0m[0m                   = (known after apply)
          [32m+[0m [0m[1m[0mvirtual_network_subnet_ids[0m[0m = (known after apply)
        }

      [32m+[0m [0mqueue_properties {
          [32m+[0m [0mcors_rule {
              [32m+[0m [0m[1m[0mallowed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_methods[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mallowed_origins[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mexposed_headers[0m[0m    = (known after apply)
              [32m+[0m [0m[1m[0mmax_age_in_seconds[0m[0m = (known after apply)
            }

          [32m+[0m [0mhour_metrics {
              [32m+[0m [0m[1m[0menabled[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0minclude_apis[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mretention_policy_days[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mversion[0m[0m               = (known after apply)
            }

          [32m+[0m [0mlogging {
              [32m+[0m [0m[1m[0mdelete[0m[0m                = (known after apply)
              [32m+[0m [0m[1m[0mread[0m[0m                  = (known after apply)
              [32m+[0m [0m[1m[0mretention_policy_days[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mversion[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0mwrite[0m[0m                 = (known after apply)
            }

          [32m+[0m [0mminute_metrics {
              [32m+[0m [0m[1m[0menabled[0m[0m               = (known after apply)
              [32m+[0m [0m[1m[0minclude_apis[0m[0m          = (known after apply)
              [32m+[0m [0m[1m[0mretention_policy_days[0m[0m = (known after apply)
              [32m+[0m [0m[1m[0mversion[0m[0m               = (known after apply)
            }
        }
    }

[1m  # module.audit_logs.module.archive_storage_account.random_string.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "random_string" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlength[0m[0m      = 4
      [32m+[0m [0m[1m[0mlower[0m[0m       = true
      [32m+[0m [0m[1m[0mmin_lower[0m[0m   = 0
      [32m+[0m [0m[1m[0mmin_numeric[0m[0m = 0
      [32m+[0m [0m[1m[0mmin_special[0m[0m = 0
      [32m+[0m [0m[1m[0mmin_upper[0m[0m   = 0
      [32m+[0m [0m[1m[0mnumber[0m[0m      = true
      [32m+[0m [0m[1m[0mresult[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mspecial[0m[0m     = false
      [32m+[0m [0m[1m[0mupper[0m[0m       = true
    }

[1m  # module.audit_logs.module.log_analytics.azurerm_log_analytics_workspace.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_log_analytics_workspace" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m             = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m                 = (known after apply)
      [32m+[0m [0m[1m[0mportal_url[0m[0m           = (known after apply)
      [32m+[0m [0m[1m[0mprimary_shared_key[0m[0m   = (sensitive value)
      [32m+[0m [0m[1m[0mresource_group_name[0m[0m  = "rg-logs-shared-services-eastus"
      [32m+[0m [0m[1m[0mretention_in_days[0m[0m    = 30
      [32m+[0m [0m[1m[0msecondary_shared_key[0m[0m = (sensitive value)
      [32m+[0m [0m[1m[0msku[0m[0m                  = "PerGB2018"
      [32m+[0m [0m[1m[0mworkspace_id[0m[0m         = (known after apply)
    }

[1m  # module.audit_logs.module.log_analytics.random_string.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "random_string" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m          = (known after apply)
      [32m+[0m [0m[1m[0mlength[0m[0m      = 6
      [32m+[0m [0m[1m[0mlower[0m[0m       = true
      [32m+[0m [0m[1m[0mmin_lower[0m[0m   = 0
      [32m+[0m [0m[1m[0mmin_numeric[0m[0m = 0
      [32m+[0m [0m[1m[0mmin_special[0m[0m = 0
      [32m+[0m [0m[1m[0mmin_upper[0m[0m   = 0
      [32m+[0m [0m[1m[0mnumber[0m[0m      = true
      [32m+[0m [0m[1m[0mresult[0m[0m      = (known after apply)
      [32m+[0m [0m[1m[0mspecial[0m[0m     = false
      [32m+[0m [0m[1m[0mupper[0m[0m       = true
    }

[1m  # module.audit_logs.module.resource_group.azurerm_resource_group.base[0m will be created[0m[0m
[0m  [32m+[0m[0m resource "azurerm_resource_group" "base" {
      [32m+[0m [0m[1m[0mid[0m[0m       = (known after apply)
      [32m+[0m [0m[1m[0mlocation[0m[0m = "eastus"
      [32m+[0m [0m[1m[0mname[0m[0m     = "rg-logs-shared-services-eastus"
    }

[1m  # module.network_transit_hub.module.virtual_network.azurerm_virtual_network.base[0m will be updated in-place[0m[0m
[0m  [33m~[0m[0m resource "azurerm_virtual_network" "base" {
        [1m[0maddress_space[0m[0m       = [
            "10.0.0.0/16",
        ]
      [33m~[0m [0m[1m[0mdns_servers[0m[0m         = [
          [31m-[0m [0m"10.0.12.10",
          [31m-[0m [0m"168.63.129.16",
        ]
        [1m[0mguid[0m[0m                = "97975f99-8aba-4136-bfde-071983d1bc42"
        [1m[0mid[0m[0m                  = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus"
        [1m[0mlocation[0m[0m            = "eastus"
        [1m[0mname[0m[0m                = "vnet-transit-hub-shared-services-eastus"
        [1m[0mresource_group_name[0m[0m = "rg-network-transit-hub-shared-services-eastus"
        [1m[0msubnet[0m[0m              = [
            {
                address_prefix = "10.0.10.0/27"
                id             = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/subnets/GatewaySubnet"
                name           = "GatewaySubnet"
                security_group = ""
            },
            {
                address_prefix = "10.0.11.0/26"
                id             = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/subnets/AzureFirewallSubnet"
                name           = "AzureFirewallSubnet"
                security_group = ""
            },
            {
                address_prefix = "10.0.12.0/24"
                id             = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/subnets/snet-adds-shared-services-eastus"
                name           = "snet-adds-shared-services-eastus"
                security_group = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-active-directory-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-addsallow-shared-services"
            },
            {
                address_prefix = "10.0.13.0/24"
                id             = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/subnets/snet-jumpbox-shared-services-eastus"
                name           = "snet-jumpbox-shared-services-eastus"
                security_group = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-jumpbox-shared-services-eastus/providers/Microsoft.Network/networkSecurityGroups/nsg-rdpallow-shared-services"
            },
            {
                address_prefix = "10.0.14.0/24"
                id             = "/subscriptions/f43de08a-5e35-4ea9-8ca1-11fc231ace6a/resourceGroups/rg-network-transit-hub-shared-services-eastus/providers/Microsoft.Network/virtualNetworks/vnet-transit-hub-shared-services-eastus/subnets/AzureBastionSubnet"
                name           = "AzureBastionSubnet"
                security_group = ""
            },
        ]
        [1m[0mtags[0m[0m                = {
            "terraform_managed" = "true"
        }
    }

[0m[1mPlan:[0m 5 to add, 1 to change, 0 to destroy.[0m

------------------------------------------------------------------------

This plan was saved to: ./shared-servicestfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "./shared-servicestfplan"

```

</details>

*Pusher: @kuhlman-labs, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI/CD`*